buzzwang1/pcb/source/Driver/STM32/L4/HAL/cUart/MpHd/v01.00.01/cUsart_MpHd.h
#ifndef __cUSART_MPHD_H__
#define __cUSART_MPHD_H__

#include "Typedef.h"
#include "stm32l4xx.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_ll_usart.h"
#include "stm32l4xx_ll_lpuart.h"
#include "stm32l4xx_ll_dma.h"

#include "cUartMpHdTimer.h"

#include "tGPPin.h"
#include "ComDat.h"

#include "ClockInfo.h"


class cComNodeUsartMpHd_Slave : public cComNode
{
public:
  cComDatMsg mpcMsg;

  cComNodeUsartMpHd_Slave(uint32 lui32TxDataSize, uint32 lui32RxDataSize)
  {
    mpcMsg.vMemAlloc(lui32TxDataSize, lui32RxDataSize);
  };

  //~cComNodeI2c_Slave() {};

  inline uint32 SizeOf()
  {
    return mpcMsg.SizeOf() -
           sizeof(mpcMsg) +
           sizeof(cComNodeUsartMpHd_Slave);
  }
};


class cComNodeListUsartMpHd_Master :public cComNodeList
{
  public:
    cComNodeListUsartMpHd_Master(uint32 lui32SlavesCnt)
      :cComNodeList(lui32SlavesCnt)
    {}

  inline uint32 SizeOf()
  {
    return cComNodeList::SizeOf() +
           sizeof(cComNodeListUsartMpHd_Master);
  }
};


class cUartMpHd
{
  public:

  cComNode::tenState   mSm;
  tenComDeviceStatus   munDeviceStatus;
  tenComBusStatus      munBusStatus;
  tenComStatus         munComStatus;

  u16                  mu16TickCounter;
  u16                  mu16DmaCounter2ms_Old;

  u32                  mu32Baudrate;

  //Single Wire, only Tx Pin
  cGpPin         mPinTx;
  USART_TypeDef *mUsart;

  uint8 mui8Adr;

  cUartMpHd(USART_TypeDef *lstUsart, u32 lu32Baudrate)
  {
    mUsart = lstUsart;

    mu32Baudrate = lu32Baudrate;

    munDeviceStatus = tenComDeviceStatus::enDeviceNotInit;
    munBusStatus    = tenComBusStatus::enBusNoError;
    munComStatus    = tenComStatus::enStatusIdle;
  }

  void  vStopDMA()
  {
    LL_USART_DisableDMAReq_RX(mUsart);
    LL_USART_DisableDMAReq_TX(mUsart);
    if (mUsart == USART1)
    {
      DMA1_Channel4->CCR &=  ~DMA_CCR_EN; // USART1_TX
      DMA1_Channel5->CCR &=  ~DMA_CCR_EN; // USART1_RX
    }
    else
    if (mUsart == USART2)
    {
      DMA1_Channel6->CCR &=  ~DMA_CCR_EN; // USART2_RX
      DMA1_Channel7->CCR &=  ~DMA_CCR_EN; // USART2_TX
    }
    else
    if (mUsart == USART3)
    {
      DMA1_Channel2->CCR &=  ~DMA_CCR_EN; // USART3_TX
      DMA1_Channel3->CCR &=  ~DMA_CCR_EN; // USART3_RX
    }
  }
  
  // Überpruft ob sich der DMA counter geändert hat. Um rauszufinden, ob irgendwas empfangen wurde
  u16 u16GetDmaCounter()
  {
    if (mUsart == USART1) return DMA1_Channel5->CNDTR;
    if (mUsart == USART2) return DMA1_Channel6->CNDTR;
    if (mUsart == USART3) return DMA1_Channel3->CNDTR;
    return 0;
  }  

  void  vStartDMA(uint8* pBuffer, uint32 BufferSize, cComNode::tenEvent lenDirection)
  {
    // Initialize the DMA with the new parameters
    if (lenDirection == cComNode::tenEvent::enEvPrepareForTx)
    {
      if (mUsart == USART1)
      {
        DMA1->IFCR = DMA_FLAG_TC4;
        DMA1_Channel4->CNDTR = BufferSize;
        DMA1_Channel4->CMAR  = (uint32)pBuffer;
        DMA1_Channel4->CCR  |=  (DMA_CCR_EN | DMA_CCR_TCIE);
      }
      else
      if (mUsart == USART2)
      {
        DMA1->IFCR = DMA_FLAG_TC7;
        DMA1_Channel7->CNDTR = BufferSize;
        DMA1_Channel7->CMAR  = (uint32)pBuffer;
        DMA1_Channel7->CCR  |=  (DMA_CCR_EN | DMA_CCR_TCIE);
      }
      else
      if (mUsart == USART3)
      {
        DMA1->IFCR = DMA_FLAG_TC2;
        DMA1_Channel2->CNDTR = BufferSize;
        DMA1_Channel2->CMAR  = (uint32)pBuffer;
        DMA1_Channel2->CCR  |=  (DMA_CCR_EN | DMA_CCR_TCIE);
      }
      LL_USART_EnableDMAReq_TX(mUsart);
    }
    else // Reception
    {
      mu16DmaCounter2ms_Old = BufferSize;
      if (mUsart == USART1)
      {
        DMA1->IFCR = DMA_FLAG_TC5;
        DMA1_Channel5->CNDTR = BufferSize;
        DMA1_Channel5->CMAR  = (uint32)pBuffer;
        DMA1_Channel5->CCR  |=  (DMA_CCR_EN | DMA_CCR_TCIE);
      }
      else
      if (mUsart == USART2)
      {
        DMA1->IFCR = DMA_FLAG_TC6;
        DMA1_Channel6->CNDTR = BufferSize;
        DMA1_Channel6->CMAR  = (uint32)pBuffer;
        DMA1_Channel6->CCR  |=  (DMA_CCR_EN | DMA_CCR_TCIE);
      }
      else
      if (mUsart == USART3)
      {
        DMA1->IFCR = DMA_FLAG_TC3;
        DMA1_Channel3->CNDTR = BufferSize;
        DMA1_Channel3->CMAR  = (uint32)pBuffer;
        DMA1_Channel3->CCR  |=  (DMA_CCR_EN | DMA_CCR_TCIE);
      }
      LL_USART_EnableDMAReq_RX(mUsart);
    }
  }

  void  vInitHw(bool lbMaster)
  {

    // Setup Pins
    if (mUsart == USART1) mPinTx.vInit(GPIOA_BASE, 9, GPIO_MODE_OUTPUT_OD, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 1);
    else if (mUsart == USART2) mPinTx.vInit(GPIOA_BASE, 2, GPIO_MODE_OUTPUT_OD, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 1);
    else if (mUsart == USART3) mPinTx.vInit(GPIOB_BASE,10, GPIO_MODE_OUTPUT_OD, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 1);


    /* Enable USART clock */
    if (mUsart == USART1) __HAL_RCC_USART1_CLK_DISABLE();
    else if (mUsart == USART2) __HAL_RCC_USART2_CLK_DISABLE();
    else if (mUsart == USART3) __HAL_RCC_USART3_CLK_DISABLE();

    // DMA Rx
    __HAL_RCC_DMA1_CLK_ENABLE();

    vStopDMA();

    //SDA and SCL must be pulled high
    if (lbMaster)
    {
      if (!bCheckPins()) return;
    }

    //Single wire, only TX line
    if (mUsart == USART1) { mPinTx.vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART1);}
    else if (mUsart == USART2) { mPinTx.vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART2);}
    else if (mUsart == USART3) { mPinTx.vSetAF(GPIO_MODE_AF_OD, GPIO_AF7_USART3);}

    // Usart Periph clock enable
    if (mUsart == USART1) __HAL_RCC_USART1_CLK_ENABLE();
    else if (mUsart == USART2) __HAL_RCC_USART2_CLK_ENABLE();
    else if (mUsart == USART3) __HAL_RCC_USART3_CLK_ENABLE();

    // Usart Peripheral Disable
    LL_USART_Disable(mUsart);

    LL_USART_InitTypeDef lstInit;
    LL_USART_StructInit(&lstInit);

    lstInit.BaudRate            = mu32Baudrate;
    lstInit.DataWidth           = LL_USART_DATAWIDTH_9B;
    lstInit.StopBits            = LL_USART_STOPBITS_1;
    lstInit.Parity              = LL_USART_PARITY_NONE;
    lstInit.TransferDirection   = LL_USART_DIRECTION_TX_RX;
    lstInit.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
    lstInit.OverSampling        = LL_USART_OVERSAMPLING_8;

    LL_USART_Init(mUsart, &lstInit);

