buzzwang1/pcb/source/Driver/STM32/L4/HAL/cUart/MpHd/v01.00.01/cUsart_MpHd.h
    LL_USART_EnableHalfDuplex(mUsart);
    LL_USART_ConfigNodeAddress(mUsart, LL_USART_ADDRESS_DETECT_4B, mui8Adr);

    if (!lbMaster)
    {
      LL_USART_EnableMuteMode(mUsart);
      LL_USART_SetWakeUpMethod(mUsart, LL_USART_WAKEUP_ADDRESSMARK);
    }

    // Usart Peripheral Enable
    LL_USART_Enable(mUsart);
    mUsart->ICR = 0xFFFFFFFF;

    if (!lbMaster)
    {
      LL_USART_RequestEnterMuteMode(mUsart);
    }

    if (isErrorActive(lbMaster))
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorDevice;
      return;
    }

    if (mUsart->ISR & USART_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      return;
    }

    // USART TC interrupt
    IRQn_Type lnNVIC_IRQChannel;
    if (mUsart == USART1) lnNVIC_IRQChannel = USART1_IRQn;
    else if (mUsart == USART2) lnNVIC_IRQChannel = USART2_IRQn;
    else /*if (mUsart == USART3)*/ lnNVIC_IRQChannel = USART3_IRQn;

    // Set the priority
    HAL_NVIC_SetPriority(lnNVIC_IRQChannel, 0, 0);
    // Enable the TIMx global Interrupt
    HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);

    mUsart->CR1 |= LL_USART_CR1_TCIE;
    mUsart->CR3 |= LL_USART_CR3_EIE;

    // ----------- DMA ---------
    // DMA Rx
    DMA_HandleTypeDef lhDMA = {};
    //IRQn_Type lnNVIC_IRQChannel;

    if (mUsart == USART1) lhDMA.Instance = DMA1_Channel5;
    else if (mUsart == USART2) lhDMA.Instance = DMA1_Channel6;
    else if (mUsart == USART3) lhDMA.Instance = DMA1_Channel3;

    lhDMA.Init.Request             = DMA_REQUEST_2;
    lhDMA.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    lhDMA.Init.PeriphInc           = DMA_PINC_DISABLE;
    lhDMA.Init.MemInc              = DMA_MINC_ENABLE;
    lhDMA.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD; // DMA_PDATAALIGN_BYTE; 16 bit wegen 9 Bit transfer
    lhDMA.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    lhDMA.Init.Mode                = DMA_NORMAL;
    lhDMA.Init.Priority            = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&lhDMA);

    // Configure DMA Channel data length
    lhDMA.Instance->CNDTR = 0;
    // Configure DMA Channel destination address
    lhDMA.Instance->CPAR = (uint32_t)&(mUsart->RDR);
    // Configure DMA Channel source address
    lhDMA.Instance->CMAR = 0;

    // DMA interrupt
    if (mUsart == USART1) lnNVIC_IRQChannel = DMA1_Channel5_IRQn; //USART1 connect to channel 7 of DMA1
    else if (mUsart == USART2) lnNVIC_IRQChannel = DMA1_Channel6_IRQn;
    else if (mUsart == USART3) lnNVIC_IRQChannel = DMA1_Channel3_IRQn;
    // Set the TIMx priority
    HAL_NVIC_SetPriority(lnNVIC_IRQChannel, 0, 0);
    // Enable the TIMx global Interrupt
    HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);

    // DMA Tx
    if (mUsart == USART1) lhDMA.Instance = DMA1_Channel4;
    else if (mUsart == USART2) lhDMA.Instance = DMA1_Channel7;
    else if (mUsart == USART3) lhDMA.Instance = DMA1_Channel2;

    lhDMA.Init.Request             = DMA_REQUEST_2;
    lhDMA.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    lhDMA.Init.PeriphInc           = DMA_PINC_DISABLE;
    lhDMA.Init.MemInc              = DMA_MINC_ENABLE;
    lhDMA.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD; // DMA_PDATAALIGN_BYTE; 16 bit wegen 9 Bit transfer
    lhDMA.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    lhDMA.Init.Mode                = DMA_NORMAL;
    lhDMA.Init.Priority            = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&lhDMA);

    // Configure DMA Channel data length
    lhDMA.Instance->CNDTR = 0;
    // Configure DMA Channel destination address
    lhDMA.Instance->CPAR = (uint32)&(mUsart->TDR);
    // Configure DMA Channel source address
    lhDMA.Instance->CMAR = 0;

    // DMA interrupt
    if (mUsart == USART1) lnNVIC_IRQChannel = DMA1_Channel4_IRQn; //USART1 connect to channel 7 of DMA1
    else if (mUsart == USART2) lnNVIC_IRQChannel = DMA1_Channel7_IRQn;
    else if (mUsart == USART3) lnNVIC_IRQChannel = DMA1_Channel2_IRQn;
    // Set the TIMx priority
    HAL_NVIC_SetPriority(lnNVIC_IRQChannel, 0, 0);
    // Enable the TIMx global Interrupt
    HAL_NVIC_EnableIRQ(lnNVIC_IRQChannel);

    munDeviceStatus = tenComDeviceStatus::enDeviceReady;
    munBusStatus    = tenComBusStatus::enBusNoError;
    munComStatus    = tenComStatus::enStatusIdle;
    mSm             = cComNode::tenState::enStIdle;
  }

  void  vReInitHw(cComNode::tenConsts lenOption, bool lbMaster)
  {
    if (lenOption == cComNode::enResetHwFull)
    {
      vInitHw(lbMaster);
    }
    else  // enResetHwDma
    {
      // Usart Peripheral Disnable
      LL_USART_Disable(mUsart);
      vStopDMA();

      if (lbMaster)
      {
        //SDA and SCL must be pulled high
        if (!bCheckPins()) return;

        mPinTx.vSetMode(GPIO_MODE_AF_OD);
      }

      mUsart->ICR = 0xFFFFFFFF;

      // Usart Peripheral Enable
      LL_USART_Enable(mUsart);

      munDeviceStatus = tenComDeviceStatus::enDeviceReady;
      munBusStatus    = tenComBusStatus::enBusNoError;
      munComStatus    = tenComStatus::enStatusIdle;
      mSm             = cComNode::tenState::enStIdle;
    }

    if (isErrorActive(lbMaster))
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorDevice;
      return;
    }

    if (mUsart->ISR & USART_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      return;
    }
  }

  bool  bCheckBus()
  {
    if (mUsart->ISR & USART_ISR_BUSY)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceError;
      munBusStatus    = tenComBusStatus::enBusNotReady;
      mSm = cComNode::enStError;
      return False;
    }
    return True;
  }

  bool  bCheckPins()
  {
    mPinTx.vSetMode(GPIO_MODE_INPUT);
    //mPinSDA->vSetMode(GPIO_MODE_INPUT);

    //Tx must be pulled high
    if (mPinTx.ui8Get() == 0)
    {
      munDeviceStatus = tenComDeviceStatus::enDeviceInitError;
      munBusStatus    = tenComBusStatus::enDeviceInitErrorPins;
      mSm             = cComNode::enStError;
      return False;
    }
    return True;
  }
  uint8 isErrorActive(bool lbMaster)
  {
    UNUSED(lbMaster);
    return 0;
  }
};



class cUartMpHdMaster : public cUartMpHd
{
  public:

  uint16             mu16ReInitTicks;
  uint16             mu16ComStuckTicks;
  uint16             mu16ComStuckTicksReload;


