buzzwang1/pcb/source/Driver/STM32/L4/HAL/cUart/MpHd/v01.00.01/cUsart_MpHd.h
  cComNodeListUsartMpHd_Master  mcSlaves;
  cComNode                      *mpcActiveSlave;
  cComDatMsg                    *mpcActiveMsg;

  cComNode::tenState   menComState;
  uint8               *mpui8ComBuf;
  uint32               mui32ComByteCnt;

  u8                   mu8Lock;

  cBotNet_DownLinkI2c_Timer mTimer;

  cUartMpHdMaster(USART_TypeDef *lstUsart, uint32 lui32Slaves, u32 lu32Baudrate)
    : cUartMpHd(lstUsart, lu32Baudrate), mcSlaves(lui32Slaves)
  {
    mSm  = cComNode::tenState::enStIdle;
    menComState = cComNode::tenState::enStIdle;

    mpcActiveSlave = NULL;
    mpcActiveMsg   = NULL;

    mui8Adr        = 0;
    mu8Lock        = 0;

    mu16ReInitTicks = 100;
    mu16ComStuckTicksReload = 1000;
    mu16ComStuckTicks = mu16ComStuckTicksReload;

    vInitHw(True);
  }

  ~cUartMpHdMaster()
  {
  }

  inline uint32 SizeOf()
  {
    return mcSlaves.SizeOf() + sizeof(cUartMpHdMaster);
  }

  inline void SetLock()   {mu8Lock = 1;}
  inline void ResetLock() {mu8Lock = 0;}

  void TIM_EV_IRQHandler()
  {
    if (mpcActiveSlave)
    {
      mpcActiveSlave->vComStart(cComNode::tenEvent::enEvMisc);
    }
  }

  void ComIrqHandler(cComNode::tenEventType lenEventType, cComNode::tenEvent lenEvent)
  {
    if (lenEventType == cComNode::tenEventType::enEvTyError)
    {
      mSm = cComNode::tenState::enStIdle;
      vStopDMA();
      mu8Lock = 0;
      mTimer.vStop();
      mUsart->ICR = 0xFFFFFFFF;
      if (mpcActiveMsg) mpcActiveMsg->vDone();
      if (mpcActiveSlave) mpcActiveSlave->vComError(cComNode::enErOverrun, menComState);
    }
    else
    {
      vSm(lenEventType, lenEvent);
    }

    if (mSm == cComNode::tenState::enStIdle)
    {
      bStartNext();
    }
  }

  void vSetReInitTicks(u16 lu16ReInitTicks)
  {
    if (!mu16ReInitTicks)
    {
      mu16ReInitTicks = lu16ReInitTicks;
    }
  }

  void vTick1ms()
  {
    mu16TickCounter++;
    vSm(cComNode::tenEventType::enEvTySw, cComNode::tenEvent::enEvTick);
  }


  void vAddSlave(cComNode *lpcSlave)
  {
    mcSlaves.vAdd(lpcSlave);
  }

  void vRemoveSlave(cComNode *lpcSlave)
  {
    mcSlaves.vRemove(lpcSlave);
  }

  void vReInitAllSlave()
  {
    mcSlaves.vSetErrorAll(cComNode::tenError::enErReInit, cComNode::cComNode::tenState::enStIdle);
  }

  void vSm(cComNode::tenEventType lenEventType, cComNode::tenEvent lenEvent)  // __attribute__((optimize("-O0")))
  {
    cComNode::tenState mSm_Old;

    UNUSED(lenEventType);

    menComState = cComNode::tenState::enStIdle;

    mSm_Old = mSm;
    switch (mSm)
    {
      case cComNode::tenState::enStIdle:
        switch (lenEvent)
        {
          case cComNode::tenEvent::enEvStart:
            //TX
            if (mpcActiveMsg->cTxData.muiLen > 0)
            {
              menComState = cComNode::tenState::enStAdressAndData;
              // Adresse nur senden wenn != 0xFF
              if (mpcActiveSlave->mAdr != 0xFF)
              {
                mUsart->TDR = mpcActiveSlave->mAdr | 0x100;
              }
              LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX); // Rx ausschalten
              vStartDMA(mpcActiveMsg->cTxData.mpu8Data, mpcActiveMsg->cTxData.muiLen, cComNode::enEvPrepareForTx);
              // Soll nach dem Senden noch was empfangen werden
              if (mpcActiveMsg->cRxData.muiLen > 0)
              {
                mSm = cComNode::tenState::enStTx;
                vStartDMA(mpcActiveMsg->cRxData.mpu8Data, mpcActiveMsg->cRxData.muiLen, cComNode::enEvPrepareForRx);
              }
              else
              {
                mSm = cComNode::tenState::enStEnd;
              }
            }
            else
            if (mpcActiveMsg->cRxData.muiLen > 0)
            {
              mu16TickCounter = 0;
              menComState = cComNode::tenState::enStWaitData;
              LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX_RX); // Alles einschalten
              vStartDMA(mpcActiveMsg->cRxData.mpu8Data, mpcActiveMsg->cRxData.muiLen, cComNode::enEvPrepareForRx);
              mSm = cComNode::tenState::enStWait;
            }
            else
            {
              mSm = cComNode::tenState::enStIdle;
              mpcActiveMsg->vDone();
              mpcActiveSlave->vComDone();
            }
            break;
          default:
            break;
        }
        break;
      case cComNode::tenState::enStTx:
        {
          if (lenEvent == cComNode::tenEvent::enEvUsartTc)
          {
             LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX_RX); // Alles einschalten
             mu16TickCounter = 0;
             menComState = cComNode::tenState::enStWaitData;
             mSm = cComNode::tenState::enStWait;
          }
        }
        break;
      case cComNode::tenState::enStWait:
        {
          switch (lenEvent)
          {
            case cComNode::tenEvent::enEvTick:
              {
                if (mu16TickCounter >= 3) // Überprüfen, ob in den letzten 2ms etwas empfangen wurde
                {
                  u16 lu16DmaCounter = u16GetDmaCounter();

                  if (mu16DmaCounter2ms_Old == lu16DmaCounter) // Counter hat sich nicht geändert
                  {
                    mSm = cComNode::tenState::enStIdle;
                    menComState = cComNode::tenState::enStIdle;
                    mpcActiveMsg->vDone();
                    mpcActiveSlave->vComError(cComNode::enErTimeout, menComState);
                    mu8Lock = 0;
                    vStopDMA();
                    bStartNext();
                  }
                  else
                  {
                    mu16TickCounter = 0;
                    mu16DmaCounter2ms_Old = lu16DmaCounter;
                  }
                }
              }
            break;
            case cComNode::tenEvent::enEvDmaRxTc:
              {
                mSm = cComNode::tenState::enStIdle;
                menComState = cComNode::tenState::enStIdle;
                mpcActiveMsg->vDone();
                mpcActiveSlave->vComDone();
              }
            break;
            default:
            break;
          }
        }
        break;
      case cComNode::tenState::enStEnd:
        {
          if (lenEvent == cComNode::tenEvent::enEvUsartTc)
          {
            // receiver abschalten um mögliche Overrun-Errors zuvermeiden.
            LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_NONE);
            mSm = cComNode::tenState::enStIdle;
            menComState = cComNode::tenState::enStIdle;
            mpcActiveMsg->vDone();
            mpcActiveSlave->vComDone();
          }
        }
        break;
      default:
        break;
    }

