buzzwang1/pcb/source/Driver/STM32/L4/HAL/cUart/MpHd/v01.00.01/cUsart_MpHd.h
    if (mSm_Old != mSm)
    {
      mu16ComStuckTicks = mu16ComStuckTicksReload;
    }
  }

  void vStartMsg(cComDatMsg *lpcActiveMsg) // __attribute__((optimize("-O0")))
  {
    if (mSm == cComNode::tenState::enStIdle)
    {
      bool lbStart;

      lbStart = true;

      if (mpcActiveMsg != NULL)
      {
        if (mpcActiveMsg->isBusy())
        {
          lbStart = false;
        }
      }

      if (lpcActiveMsg != NULL)
      {
        if (lpcActiveMsg->isBusy())
        {
          lbStart = false;
        }
      }

      lbStart &= bCheckBus();

      if (lbStart)
      {
        mpcActiveMsg = lpcActiveMsg;
        mpcActiveMsg->vBusy();
        vSm(cComNode::tenEventType::enEvTySw, cComNode::tenEvent::enEvStart);
      }
    }
  }

  bool bStartNext() // __attribute__((optimize("-O0")))
  {
    if ((mSm == cComNode::tenState::enStIdle) && (!mu8Lock))
    {
      bool lbStart;

      lbStart = true;

      if (mpcActiveMsg != NULL)
      {
        if (mpcActiveMsg->isBusy())
        {
          lbStart = false;
        }
      }

      if (lbStart)
      {
        lbStart &= (!mcSlaves.isEmpty());
      }

      lbStart &= bCheckBus();

      if (lbStart)
      {
        mpcActiveSlave = (cComNode*)mcSlaves.cGetNext();
        mpcActiveSlave->mStatus.IsStartRequested = 0;
        mpcActiveSlave->vComStart(cComNode::tenEvent::enEvPrepareToSendData);
      }
    }

    if (mSm == cComNode::enStError)
    {
      if (mu16ReInitTicks)
      {
        mu16ReInitTicks--;

        if (!mu16ReInitTicks)
        {
          mpcActiveMsg   = NULL;
          mu8Lock        = 0;
          this->vReInitHw(cComNode::tenConsts::enResetHwFull, True);
          this->vReInitAllSlave();
        }
      }
    }
    else
    {
      mu16ReInitTicks   = 100;
    }

    if (munComStatus != tenComStatus::enStatusStuck)
    {
      if (mu16ComStuckTicks)
      {
        if (mSm != cComNode::tenState::enStIdle)
        {
          mu16ComStuckTicks--;
        }
      }
      else
      {
        mSm = cComNode::enStError;
        munDeviceStatus   = tenComDeviceStatus::enDeviceReady;
        munBusStatus      = tenComBusStatus::enBusNoError;
        munComStatus      = tenComStatus::enStatusStuck;
        mu16ComStuckTicks = mu16ComStuckTicksReload;
        mu16ReInitTicks   = 100;
      }
    }

    if (mSm == cComNode::enStError)
    {
      return False;
    }
    return True;
  }
};



class cUartMpHdSlave : public cUartMpHd
{
  public:
  cComDatMsg          *mpcMsg;

  cComNode            *mpcComNode;
  cComNode::tenState   menComState;
  cComNode::tenError   menErrorActive;

  cBotNet_DownLinkI2c_Timer mTimer;

  cUartMpHdSlave(USART_TypeDef *lstUsart, u32 lu32Baudrate)
  : cUartMpHd(lstUsart, lu32Baudrate)
  {
    mSm         = cComNode::tenState::enStIdle;
    menComState = cComNode::tenState::enStIdle;
    mpcComNode  = NULL;
  }

  ~cUartMpHdSlave()
  {
  }

  void vTick1ms()
  {
    mu16TickCounter++;
    vSm(cComNode::tenEventType::enEvTySw, cComNode::tenEvent::enEvTick);
  }

  void vSetNode(cComNode *lpcComNode)
  {
    mpcComNode = lpcComNode;
    mui8Adr    = mpcComNode->mAdr;
    if (mpcComNode != null)
    {
      vInitHw(False);
    }
  }

  void TIM_EV_IRQHandler()
  {
    if (mpcComNode)
    {
      mpcComNode->vComStart(cComNode::enEvMisc);
    }
  }

  void ComIrqHandler(cComNode::tenEventType lenEventType, cComNode::tenEvent lenEvent)
  {
    if (lenEventType == cComNode::tenEventType::enEvTyError)
    {
      mSm = cComNode::tenState::enStIdle;
      vStopDMA();
      mTimer.vStop();
      mUsart->ICR = 0xFFFFFFFF;
      mpcMsg->vDone();
      mpcComNode->vComError(cComNode::enErOverrun, menComState);
    }
    else
    {
      vSm(lenEventType, lenEvent);
    }

    if (mSm == cComNode::tenState::enStIdle)
    {
      bStartNext();
    }
  }

  void  vError()
  {
  }

  void vSetMsg(cComDatMsg* lpcMsg)
  {
    mpcMsg = lpcMsg;
  };

  inline void vMute()
  {
    LL_USART_RequestEnterMuteMode(mUsart);
  }


  void vSm(cComNode::tenEventType lenEventType, cComNode::tenEvent lenEvent)  // __attribute__((optimize("-O0")))
  {
    UNUSED(lenEventType);
    if (isErrorActive(True))
    {
      vError();
      return;
    }

    switch (mSm)
    {
      case cComNode::tenState::enStIdle:
        switch (lenEvent)
        {
          case cComNode::tenEvent::enEvStart:
            // Beim slave Rx vor Tx.
            // Rx
            if (mpcMsg->cRxData.muiLen > 0)
            {
              mu16TickCounter = 0;
              menComState = cComNode::tenState::enStWaitAdressAndData;
              LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX_RX); // Alles einschalten
              vStartDMA(mpcMsg->cRxData.mpu8Data, mpcMsg->cRxData.muiLen, cComNode::enEvPrepareForRx);
              mSm = cComNode::tenState::enStWait;
            }
            else
            {
              // Tx
              if (mpcMsg->cTxData.muiLen > 0)
              {
                menComState = cComNode::tenState::enStData;
                LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX); // Rx ausschalten
                vStartDMA(mpcMsg->cTxData.mpu8Data, mpcMsg->cTxData.muiLen, cComNode::enEvPrepareForTx);
                mSm = cComNode::tenState::enStEnd;
              }
              else
              {
                mSm = cComNode::tenState::enStIdle;
                mpcMsg->vDone();
                mpcComNode->vComDone();
              }
            }
            break;
          default:
            break;
        }
        break;

      case cComNode::tenState::enStWait:
        {
          switch (lenEvent)
          {
            case cComNode::tenEvent::enEvTick:
              {
                if (mu16TickCounter >= 3) // Überprüfen, ob in den letzten 3ms etwas empfangen wurde
                {
                  u16 lu16DmaCounter = u16GetDmaCounter();

                  if ((mu16DmaCounter2ms_Old == lu16DmaCounter) && // Counter hat sich nicht geändert
                      (!(mUsart->ISR & USART_ISR_RWU)))            // Nicht in Mute modus
                  {
                    mSm = cComNode::tenState::enStIdle;
                    vStopDMA();
                    menComState = cComNode::tenState::enStIdle;
                    mpcMsg->vDone();
                    mpcComNode->vComError(cComNode::enErTimeout, menComState);
                    bStartNext();
                  }
                  else
                  {
                    mu16TickCounter = 0;
                    mu16DmaCounter2ms_Old = lu16DmaCounter;
                  }
                }
              }
            break;
            case cComNode::tenEvent::enEvDmaRxTc:
              {
                // Soll nach dem Empfangen noch was gesendet werden
                if (mpcMsg->cTxData.muiLen > 0)
                {
                  menComState = cComNode::tenState::enStData;
                  LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_TX); // Rx ausschalten
                  vStartDMA(mpcMsg->cTxData.mpu8Data, mpcMsg->cTxData.muiLen, cComNode::enEvPrepareForTx);
                  mSm = cComNode::tenState::enStEnd;
                }
                else
                {
                  mSm = cComNode::tenState::enStIdle;
                  menComState = cComNode::tenState::enStIdle;
                  mpcMsg->vDone();
                  mpcComNode->vComDone();
                }
              }
            break;
            default:
            break;
          }
        }
        break;
      case cComNode::tenState::enStEnd:
        {
          if ((lenEvent == cComNode::tenEvent::enEvDmaRxTc) || (lenEvent == cComNode::tenEvent::enEvUsartTc))
          {
            // receiver abschalten um mögliche Overrun-Errors zuvermeiden.
            LL_USART_SetTransferDirection(mUsart, LL_USART_DIRECTION_NONE);
            mSm = cComNode::tenState::enStIdle;
            menComState = cComNode::tenState::enStIdle;
            mpcMsg->vDone();
            mpcComNode->vComDone();
          }
        }
        break;
      default:
        break;
    }
  }

  void vStartMsg(cComDatMsg *lpcActiveMsg) // __attribute__((optimize("-O0")))
  {
    if (mSm == cComNode::tenState::enStIdle)
    {
      bool lbStart;

      lbStart = true;

      if (mpcMsg != NULL)
      {
        if (mpcMsg->isBusy())
        {
          lbStart = false;
        }
      }

      if (lpcActiveMsg != NULL)
      {
        if (lpcActiveMsg->isBusy())
        {
          lbStart = false;
        }
      }

      if (lbStart)
      {
        mpcMsg = lpcActiveMsg;
        mpcMsg->vBusy();
        vSm(cComNode::tenEventType::enEvTySw, cComNode::tenEvent::enEvStart);
      }
    }
  }

  bool bStartNext() // __attribute__((optimize("-O0")))
  {
    if (mSm == cComNode::tenState::enStIdle)
    {
      bool lbStart;

      lbStart = true;

      if (mpcMsg != NULL)
      {
        if (mpcMsg->isBusy())
        {
          lbStart = false;
        }
      }

      if (mpcComNode != NULL)
      {
        if (!mpcComNode->mStatus.IsStartRequested)
        {
          lbStart = false;
        }
      }

      if (lbStart)
      {
        mpcComNode->mStatus.IsStartRequested = 0;
        mpcComNode->vComStart(cComNode::enEvPrepareToReceiveData);
      }
    }
    return True;
  }
};


#endif // __cUSART_MPHD_H__
